Revit 2024 API
AssetSet Class
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetSet : APIObject, IEnumerable
Visual Basic
Public Class AssetSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class AssetSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Visual.AssetSet
See Also
AssetSet Members
Autodesk.Revit.DB.Visual Namespace